In [2]:
import numpy as np
%matplotlib inline
import pandas as pd

In [10]:
#f_series = pd.Series(list('abcde'))
#print(f_series)

In [13]:
#from IPython.core.display import HTML
#css=open('style-table.css').read()+ open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [3]:
titles= pd.read_csv('cast.csv')
titles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [5]:
#titles.count()
#or
len(titles)

3786176

In [38]:
movies = titles["title"].count()
print(movies)

3786176

### What are the earliest two films listed in the titles dataframe?

In [18]:
titles.head(2)

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

In [20]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3786176 entries, 0 to 3786175
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 173.3+ MB

In [21]:
titles.dtypes

title         object
year           int64
name          object
type          object
character     object
n            float64
dtype: object

In [22]:
titles.describe()

               year             n
count  3.786176e+06  2.327603e+06
mean   1.988911e+03  1.690599e+01
std    2.789225e+01  3.170679e+01
min    1.894000e+03  1.000000e+00
25%    1.970000e+03  5.000000e+00
50%    2.001000e+03  1.000000e+01
75%    2.012000e+03  2.100000e+01
max    2.115000e+03  3.361300e+04

In [28]:
titles.notnull().sum()

title        3786176
year         3786176
name         3786176
type         3786176
character    3786176
n            2327603
dtype: int64

### How many movies have the title "Hamlet"?

In [40]:
titles["title"].value_counts()["Hamlet"]

342

In [4]:
len(titles[titles.title=='Hamlet'])

342

### How many movies are titled "North by Northwest"?

In [46]:
titles["title"].value_counts()["North by Northwest"]

116

### When was the first movie titled "Hamlet" made?

In [156]:
hamlet = titles.loc[titles['title'] == 'Hamlet'] #it will return all movies named with hamlet 
#print(hamlet)
year1 = hamlet.sort_values(by="year", ascending=True) #sorting by year

#print(year1)
arr = np.array(year1)
print(arr[0,1])

1910

In [125]:
#method2
hamlet = titles.loc[titles['title'] == 'Hamlet'] #it will return all movies named with hamlet 
#print(hamlet)
year1 = hamlet.sort_values(by="year", ascending=True) #sorting by year
year1.iloc[0,1]

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [131]:
titles.loc[titles["title"]=="Treasure Island"]

,title,year,name,type,character,n
9852,Treasure Island,1934,Robert Adair,actor,Tom - Seaman,NaN
13805,Treasure Island,1950,Chris Adcock,actor,Pike,26.0
16943,Treasure Island,1985,Yves Afonso,actor,French Captain,8.0
43776,Treasure Island,1972,Cristino Almod?var,actor,O'Brien,16.0
57363,Treasure Island,1934,John (XII) Anderson,actor,Pirate of the Spanish Main,18.0
...,...,...,...,...,...,...
3576899,Treasure Island,1999,Rachel Singer,actress,Anna,6.0
3636299,Treasure Island,1934,Jane Talent,actress,Streetwalker,NaN
3675225,Treasure Island,1999,Guinevere Turner,actress,Evelyn,14.0
3724015,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3727677,Treasure Island,1973,Jane Webb,actress,Mrs. Hawkins,6.0

### How many movies were made in the year 1950?

In [132]:
titles['year'].value_counts()[1950]

22397

### How many movies were made in the year 1960?

In [133]:
titles['year'].value_counts()[1960]

19164

### How many movies were made from 1950 through 1959?

In [135]:
movies_total = 0
for i in range(1950,1960):
    movies_total = movies_total + titles['year'].value_counts()[i]
print(movies_total)

215471

### In what years had a movie titled "Batman" been released?

In [161]:
bat = titles.loc[titles['title']=="Batman"]
bat.iloc[:,0:2]

          title  year
99564    Batman  1943
100080   Batman  1943
118792   Batman  1989
124426   Batman  1989
155945   Batman  1989
...         ...   ...
3031640  Batman  1989
3402807  Batman  1943
3499598  Batman  1989
3501652  Batman  1989
3513305  Batman  1989

[123 rows x 2 columns]

### How many roles were there in the movie "Inception"?

In [172]:
incep = titles.loc[titles['title']=='Inception']
incep['character'].value_counts().sum()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [182]:
incep = titles.loc[titles['title']=='Inception']
incep['n'].isnull().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [183]:
incep = titles.loc[titles['title']=='Inception']
incep['n'].notnull().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [199]:
north = titles.loc[titles['title']=="North by Northwest"] #data for only "North by Northwest"
#print(north[north['n'].notna()])
numn = north.loc[north['n'].notna()] #data for only numeric n value

numn.iloc[:,2:3] #cast for numerica n value

                         name
206471           Edward Binns
356707         Leo G. Carroll
464736        Philip Coolidge
665768      Robert Ellenstein
871426             Cary Grant
1275337         Martin Landau
1384780             Ken Lynch
1457165           James Mason
1508344         Patrick McVey
1695173           Philip Ober
1811387          Edward Platt
2295714          Les Tremayne
2447081         Adam Williams
3048272  Josephine Hutchinson
3157232   Jessie Royce Landis
3518333       Eva Marie Saint

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [211]:
sl = titles.loc[titles['title']=="Sleuth"] #shows data for only sleuth
data1 = sl.loc[sl['n'].notnull()] #for numeric n not null
data2 = data1.loc[data1['year']==1972] 
#data1 with cast only
data2.iloc[:,2:3]

                       name
326773        Michael Caine
373876       Alec Cawthorne
1448690        Teddy Martin
1465483  John (II) Matthews
1705394    Laurence Olivier
2724553  Eve (III) Channing

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [221]:
sl = titles.loc[titles['title']=="Sleuth"] #shows data for only sleuth
data1 = sl.loc[sl['year']==2007] 
data1.iloc[:,2:3]
#for year 2007

                        name
260242       Kenneth Branagh
326774         Michael Caine
373877   Alec (II) Cawthorne
1293634             Jude Law
1805907        Harold Pinter
2724552    Eve (II) Channing
3370424    Carmel O'Sullivan

### How many roles were credited in the silent 1921 version of Hamlet?

In [233]:
titles.loc[(titles['title']=='Hamlet') & (titles['year']==1921)]

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

### How many roles were credited in Branagh's 1996 Hamlet?

In [255]:
roles_hamlet_1996 = titles.loc[(titles['title']=='Hamlet') & (titles['year']==1996)]
roles_hamlet_1996['name'].value_counts()['Kenneth Branagh']
#titles['name']==''

1

### How many "Hamlet" roles have been listed in all film credits through history?

In [260]:
hamlet_character = titles.loc[titles['character']=='Hamlet']
hamlet_character['title'].value_counts().sum()

96

### How many people have played an "Ophella"?

In [264]:
ophella = titles.loc[titles['character']=='Ophella']
ophella['character'].value_counts().sum()

1

### How many people have played a role called "The Dude"?

In [268]:
role_dude = titles.loc[titles['character']=='The Dude']
role_dude['character'].count()

19

### How many people have played a role called "The Stranger"?

In [269]:
role_stra = titles.loc[titles['character']=='The Stranger']
role_stra['character'].count()

212

### How many roles has Sidney Poitier played throughout his career?

In [273]:
role_sid = titles.loc[titles['name']=='Sidney Poitier']
role_sid['name'].count()

43

### How many roles has Judi Dench played?

In [275]:
role_judi = titles.loc[titles['name']=='Judi Dench']
role_judi['name'].count()

55

### List the supporting roles (having n-2) played by Cary Grant in the 1940s, in order by year.

In [284]:
roles = titles.loc[(titles['name']=='Cary Grant') & (titles['year']>=1940) & (titles['year']<=1949) & (titles['n']==2)]
roles.sort_values('year', ascending=False)

                   title  year        name   type    character    n
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0

### List the leading roles that Cary Grant played In the 1940s in order by year.

In [285]:
roles = titles.loc[(titles['name']=='Cary Grant') & (titles['year']>=1940) & (titles['year']<=1949) & (titles['n']==1)]
roles.sort_values('year', ascending=False)

,title,year,name,type,character,n
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [301]:
year_1950 = titles.loc[(titles['year']==1950) & (titles['type']=='actress')]
year_1950['character'].count()

5637

### How many roles were available for actresses in the 1950s?

In [302]:
year_1950 = titles.loc[(titles['year']==1950) & (titles['type']=='actor')]
year_1950['character'].count()

16760

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [309]:
c = titles.loc[(titles['year']>=1980) & (titles['n']==1)]
c['n'].count()

89276

### How many non-leading roles were available through from the beginning of film history through 1980?

In [310]:
c = titles.loc[(titles['year']>=1980) & (titles['n']==2)]
c['n'].count()

83413

### How many rows through 1980 were minor enough that they did not well and turn numeric "n" rank?

In [316]:
c = titles.loc[(titles['year']>=1980) & (titles['n'].isnull())]
c['year'].count()

1014692